modm-ext/data.modm.io/docs/svd/header_stm32wb05.svd
        <register>
          <name>SYNTHCAL4_DIG_OUT</name>
          <addressOffset>0x290</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MOD_REF_DAC_WORD_OUT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNTHCAL5_DIG_OUT</name>
          <addressOffset>0x294</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CBP_CALIB_WORD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_STATUS_DIG_OUT</name>
          <addressOffset>0x298</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>STATUS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SYNTH_CAL_ERROR</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ_STATUS_DIG_OUT</name>
          <addressOffset>0x29c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RESERVED7_0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RSSI0_DIG_OUT</name>
          <addressOffset>0x2a4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RSSI_MEAS_OUT_7_0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RSSI1_DIG_OUT</name>
          <addressOffset>0x2a8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RSSI_MEAS_OUT_15_8</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_DIG_OUT</name>
          <addressOffset>0x2ac</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AGC_ATT_OUT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DEMOD_DIG_OUT</name>
          <addressOffset>0x2b0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CI_FIELD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>AAC_FOUND</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PD_FOUND</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_END</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC0_DIG_ENG</name>
          <addressOffset>0x2c0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AGC_THR_HIGH</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>AGC_ENABLE</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC1_DIG_ENG</name>
          <addressOffset>0x2c4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AGC_THR_LOW_6</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>AGC_AUTOLOCK</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AGC_LOCK_SYNC</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC2_DIG_ENG</name>
          <addressOffset>0x2c8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AGC_THR_LOW_12</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC3_DIG_ENG</name>
          <addressOffset>0x2cc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AUTOLOCK_THR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC4_DIG_ENG</name>
          <addressOffset>0x2d0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AGC_HOLD_TIME_FAST</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AGC_HOLD_TIME_SLOW</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC5_DIG_ENG</name>
          <addressOffset>0x2d4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>T_MEAS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>T_INT</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC6_DIG_ENG</name>
          <addressOffset>0x2d8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HOLD_TIME_SEL_10_4</name>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC7_DIG_ENG</name>
          <addressOffset>0x2dc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TH_LOW_SEL_10_4</name>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC8_DIG_ENG</name>
          <addressOffset>0x2e0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HOLD_TIME_SEL_3_0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TH_LOW_SEL_3_0</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC9_DIG_ENG</name>
          <addressOffset>0x2e4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>START_SEQ</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MAX_SEQ</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC10_DIG_ENG</name>
          <addressOffset>0x2e8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATT_0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC11_DIG_ENG</name>
          <addressOffset>0x2ec</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATT_1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC12_DIG_ENG</name>
          <addressOffset>0x2f0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATT_2</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC13_DIG_ENG</name>
          <addressOffset>0x2f4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATT_3</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC14_DIG_ENG</name>
          <addressOffset>0x2f8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATT_4</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC15_DIG_ENG</name>
          <addressOffset>0x2fc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATT_5</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC16_DIG_ENG</name>
          <addressOffset>0x300</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATT_6</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC17_DIG_ENG</name>
          <addressOffset>0x304</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATT_7</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC18_DIG_ENG</name>
          <addressOffset>0x308</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATT_8</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC19_DIG_ENG</name>
          <addressOffset>0x30c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATT_9</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC20_DIG_ENG</name>
          <addressOffset>0x310</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>I_GAIN_COMP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RXADC_HW_TRIM_OUT</name>
          <addressOffset>0x324</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HW_RXADC_DELAYTRIM_I</name>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>HW_RXADC_DELAYTRIM_Q</name>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CBIAS0_HW_TRIM_OUT</name>
          <addressOffset>0x328</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HW_CBIAS_IBIAS_TRIM</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HW_CBIAS_IPTAT_TRIM</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_HW_TRIM_OUT</name>
          <addressOffset>0x330</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HW_AGC_ANTENNAE_TRIM</name>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ANTSW_DIG0_USR</name>
          <addressOffset>0x340</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>ANTSW_DIG1_USR</name>
          <addressOffset>0x344</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>ANTSW_DIG2_USR</name>
          <addressOffset>0x348</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>ANTSW_DIG3_USR</name>
          <addressOffset>0x34c</addressOffset>
          <size>0x20</size>
        </register>
